Python 3.10.2 (tags/v3.10.2:a58ebcc, Jan 17 2022, 14:12:15) [MSC v.1929 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
for i in range(3) :
    print("hello")

hello
hello
hello
for i in range(10, 101, 3) :
    print(i)

10
13
16
19
22
25
28
31
34
37
40
43
46
49
52
55
58
61
64
67
70
73
76
79
82
85
88
91
94
97
100
for i in range(9, 101, 3) :
    print(i)

9
12
15
18
21
24
27
30
33
36
39
42
45
48
51
54
57
60
63
66
69
72
75
78
81
84
87
90
93
96
99
for i in range[2, 5, 6] :
    print("hello", i)

Traceback (most recent call last):
  File "<pyshell#11>", line 1, in <module>
    for i in range[2, 5, 6] :
TypeError: 'type' object is not subscriptable
for _ in range(10) :
    print("hello")

hello
hello
hello
hello
hello
hello
hello
hello
hello
hello
for i in range(100, 1, -5) :
    print(i)

100
95
90
85
80
75
70
65
60
55
50
45
40
35
30
25
20
15
10
5
for i in range(10, 1, -1) :
    print(i)

10
9
8
7
6
5
4
3
2
hap=0
for i in range(1, 11) :
    hap=hap+i

hap=0
for i in range(1, 11) :
    hap+=i
    print(hap)

1
3
6
10
15
21
28
36
45
55

hap=0
for i in range(1, 11) :
    hap+=i
    print(hap, end="")

13610152128364555
hap=0
for i in range(1, 11) :
    hap+=i
    print(hap, end=" ")

SyntaxError: multiple statements found while compiling a single statement

hap=0
for i in range(1, 11) :
    hap+=i
    print(hap, end=" ")

SyntaxError: multiple statements found while compiling a single statement


hap=0
for i in range(1, 11) :
    hap+=i
    print(hap, end=" ")

1 3 6 10 15 21 28 36 45 55 

i, hap = 0, 0
for i in range(501, 1001, 2) :
    hap=hap+i

print("%d" % hap)
187500

======================== RESTART: C:/Cookpython/s6-1.py ========================
0과 100 사이에 있는 7의 배수 합계 : 750

======================== RESTART: C:/Cookpython/s6-1.py ========================
0과 100 사이에 있는 7의 배수 합계 : 735

====================== RESTART: C:/Cookpython/code06-06.py =====================
단을 입력하세요 : 6
6 * 1 = 6
6 * 2 = 12
6 * 3 = 18
6 * 4 = 24
6 * 5 = 30
6 * 6 = 36
6 * 7 = 42
6 * 8 = 48
6 * 9 = 54

======================== RESTART: C:/Cookpython/s6-2.py ========================
단을 입력하세요 : 7


======================== RESTART: C:/Cookpython/s6-2.py ========================
단을 입력하세요 : 7

======================== RESTART: C:/Cookpython/s6-2.py ========================
단을 입력하세요 : 7
9 * 7 = 63
8 * 7 = 56
7 * 7 = 49
6 * 7 = 42
5 * 7 = 35
4 * 7 = 28
3 * 7 = 21
2 * 7 = 14
1 * 7 = 7

====================== RESTART: C:/Cookpython/code06-07.py =====================
2 * 1 =  2 2 * 2 =  4 2 * 3 =  6 2 * 4 =  8 2 * 5 = 10 2 * 6 = 12 2 * 7 = 14 2 * 8 = 16 2 * 9 = 18 

3 * 1 =  3 3 * 2 =  6 3 * 3 =  9 3 * 4 = 12 3 * 5 = 15 3 * 6 = 18 3 * 7 = 21 3 * 8 = 24 3 * 9 = 27 

4 * 1 =  4 4 * 2 =  8 4 * 3 = 12 4 * 4 = 16 4 * 5 = 20 4 * 6 = 24 4 * 7 = 28 4 * 8 = 32 4 * 9 = 36 

5 * 1 =  5 5 * 2 = 10 5 * 3 = 15 5 * 4 = 20 5 * 5 = 25 5 * 6 = 30 5 * 7 = 35 5 * 8 = 40 5 * 9 = 45 

6 * 1 =  6 6 * 2 = 12 6 * 3 = 18 6 * 4 = 24 6 * 5 = 30 6 * 6 = 36 6 * 7 = 42 6 * 8 = 48 6 * 9 = 54 

7 * 1 =  7 7 * 2 = 14 7 * 3 = 21 7 * 4 = 28 7 * 5 = 35 7 * 6 = 42 7 * 7 = 49 7 * 8 = 56 7 * 9 = 63 

8 * 1 =  8 8 * 2 = 16 8 * 3 = 24 8 * 4 = 32 8 * 5 = 40 8 * 6 = 48 8 * 7 = 56 8 * 8 = 64 8 * 9 = 72 

9 * 1 =  9 9 * 2 = 18 9 * 3 = 27 9 * 4 = 36 9 * 5 = 45 9 * 6 = 54 9 * 7 = 63 9 * 8 = 72 9 * 9 = 81 


====================== RESTART: C:/Cookpython/code06-07.py =====================
2 * 1 =  2
2 * 2 =  4
2 * 3 =  6
2 * 4 =  8
2 * 5 = 10
2 * 6 = 12
2 * 7 = 14
2 * 8 = 16
2 * 9 = 18

3 * 1 =  3
3 * 2 =  6
3 * 3 =  9
3 * 4 = 12
3 * 5 = 15
3 * 6 = 18
3 * 7 = 21
3 * 8 = 24
3 * 9 = 27

4 * 1 =  4
4 * 2 =  8
4 * 3 = 12
4 * 4 = 16
4 * 5 = 20
4 * 6 = 24
4 * 7 = 28
4 * 8 = 32
4 * 9 = 36

5 * 1 =  5
5 * 2 = 10
5 * 3 = 15
5 * 4 = 20
5 * 5 = 25
5 * 6 = 30
5 * 7 = 35
5 * 8 = 40
5 * 9 = 45

6 * 1 =  6
6 * 2 = 12
6 * 3 = 18
6 * 4 = 24
6 * 5 = 30
6 * 6 = 36
6 * 7 = 42
6 * 8 = 48
6 * 9 = 54

7 * 1 =  7
7 * 2 = 14
7 * 3 = 21
7 * 4 = 28
7 * 5 = 35
7 * 6 = 42
7 * 7 = 49
7 * 8 = 56
7 * 9 = 63

8 * 1 =  8
8 * 2 = 16
8 * 3 = 24
8 * 4 = 32
8 * 5 = 40
8 * 6 = 48
8 * 7 = 56
8 * 8 = 64
8 * 9 = 72

9 * 1 =  9
9 * 2 = 18
9 * 3 = 27
9 * 4 = 36
9 * 5 = 45
9 * 6 = 54
9 * 7 = 63
9 * 8 = 72
9 * 9 = 81


======================== RESTART: C:/Cookpython/s6-3.py ========================
## 2단 ##
2 * 1 =  2
2 * 2 =  4
2 * 3 =  6
2 * 4 =  8
2 * 5 = 10
2 * 6 = 12
2 * 7 = 14
2 * 8 = 16
2 * 9 = 18

## 3단 ##
3 * 1 =  3
3 * 2 =  6
3 * 3 =  9
3 * 4 = 12
3 * 5 = 15
3 * 6 = 18
3 * 7 = 21
3 * 8 = 24
3 * 9 = 27

## 4단 ##
4 * 1 =  4
4 * 2 =  8
4 * 3 = 12
4 * 4 = 16
4 * 5 = 20
4 * 6 = 24
4 * 7 = 28
4 * 8 = 32
4 * 9 = 36

## 5단 ##
5 * 1 =  5
5 * 2 = 10
5 * 3 = 15
5 * 4 = 20
5 * 5 = 25
5 * 6 = 30
5 * 7 = 35
5 * 8 = 40
5 * 9 = 45

## 6단 ##
6 * 1 =  6
6 * 2 = 12
6 * 3 = 18
6 * 4 = 24
6 * 5 = 30
6 * 6 = 36
6 * 7 = 42
6 * 8 = 48
6 * 9 = 54

## 7단 ##
7 * 1 =  7
7 * 2 = 14
7 * 3 = 21
7 * 4 = 28
7 * 5 = 35
7 * 6 = 42
7 * 7 = 49
7 * 8 = 56
7 * 9 = 63

## 8단 ##
8 * 1 =  8
8 * 2 = 16
8 * 3 = 24
8 * 4 = 32
8 * 5 = 40
8 * 6 = 48
8 * 7 = 56
8 * 8 = 64
8 * 9 = 72

## 9단 ##
9 * 1 =  9
9 * 2 = 18
9 * 3 = 27
9 * 4 = 36
9 * 5 = 45
9 * 6 = 54
9 * 7 = 63
9 * 8 = 72
9 * 9 = 81


====================== RESTART: C:/Cookpython/code06-08.py =====================
# 2단 ## 3단 ## 4단 ## 5단 ## 6단 ## 7단 ## 8단 ## 9단 #
 2 *  1 =  2 3 *  1 =  3 4 *  1 =  4 5 *  1 =  5 6 *  1 =  6 7 *  1 =  7 8 *  1 =  8 9 *  1 =  9
 2 *  2 =  4 3 *  2 =  6 4 *  2 =  8 5 *  2 = 10 6 *  2 = 12 7 *  2 = 14 8 *  2 = 16 9 *  2 = 18
 2 *  3 =  6 3 *  3 =  9 4 *  3 = 12 5 *  3 = 15 6 *  3 = 18 7 *  3 = 21 8 *  3 = 24 9 *  3 = 27
 2 *  4 =  8 3 *  4 = 12 4 *  4 = 16 5 *  4 = 20 6 *  4 = 24 7 *  4 = 28 8 *  4 = 32 9 *  4 = 36
 2 *  5 = 10 3 *  5 = 15 4 *  5 = 20 5 *  5 = 25 6 *  5 = 30 7 *  5 = 35 8 *  5 = 40 9 *  5 = 45
 2 *  6 = 12 3 *  6 = 18 4 *  6 = 24 5 *  6 = 30 6 *  6 = 36 7 *  6 = 42 8 *  6 = 48 9 *  6 = 54
 2 *  7 = 14 3 *  7 = 21 4 *  7 = 28 5 *  7 = 35 6 *  7 = 42 7 *  7 = 49 8 *  7 = 56 9 *  7 = 63
 2 *  8 = 16 3 *  8 = 24 4 *  8 = 32 5 *  8 = 40 6 *  8 = 48 7 *  8 = 56 8 *  8 = 64 9 *  8 = 72
 2 *  9 = 18 3 *  9 = 27 4 *  9 = 36 5 *  9 = 45 6 *  9 = 54 7 *  9 = 63 8 *  9 = 72 9 *  9 = 81

====================== RESTART: C:/Cookpython/code06-08.py =====================
#  2단  ##  3단  ##  4단  ##  5단  ##  6단  ##  7단  ##  8단  ##  9단  #
 2 *  1 =  2 3 *  1 =  3 4 *  1 =  4 5 *  1 =  5 6 *  1 =  6 7 *  1 =  7 8 *  1 =  8 9 *  1 =  9
 2 *  2 =  4 3 *  2 =  6 4 *  2 =  8 5 *  2 = 10 6 *  2 = 12 7 *  2 = 14 8 *  2 = 16 9 *  2 = 18
 2 *  3 =  6 3 *  3 =  9 4 *  3 = 12 5 *  3 = 15 6 *  3 = 18 7 *  3 = 21 8 *  3 = 24 9 *  3 = 27
 2 *  4 =  8 3 *  4 = 12 4 *  4 = 16 5 *  4 = 20 6 *  4 = 24 7 *  4 = 28 8 *  4 = 32 9 *  4 = 36
 2 *  5 = 10 3 *  5 = 15 4 *  5 = 20 5 *  5 = 25 6 *  5 = 30 7 *  5 = 35 8 *  5 = 40 9 *  5 = 45
 2 *  6 = 12 3 *  6 = 18 4 *  6 = 24 5 *  6 = 30 6 *  6 = 36 7 *  6 = 42 8 *  6 = 48 9 *  6 = 54
 2 *  7 = 14 3 *  7 = 21 4 *  7 = 28 5 *  7 = 35 6 *  7 = 42 7 *  7 = 49 8 *  7 = 56 9 *  7 = 63
 2 *  8 = 16 3 *  8 = 24 4 *  8 = 32 5 *  8 = 40 6 *  8 = 48 7 *  8 = 56 8 *  8 = 64 9 *  8 = 72
 2 *  9 = 18 3 *  9 = 27 4 *  9 = 36 5 *  9 = 45 6 *  9 = 54 7 *  9 = 63 8 *  9 = 72 9 *  9 = 81

====================== RESTART: C:/Cookpython/code06-08.py =====================
#   2단   ##   3단   ##   4단   ##   5단   ##   6단   ##   7단   ##   8단   ##   9단   #
 2 *  1 =  2 3 *  1 =  3 4 *  1 =  4 5 *  1 =  5 6 *  1 =  6 7 *  1 =  7 8 *  1 =  8 9 *  1 =  9
 2 *  2 =  4 3 *  2 =  6 4 *  2 =  8 5 *  2 = 10 6 *  2 = 12 7 *  2 = 14 8 *  2 = 16 9 *  2 = 18
 2 *  3 =  6 3 *  3 =  9 4 *  3 = 12 5 *  3 = 15 6 *  3 = 18 7 *  3 = 21 8 *  3 = 24 9 *  3 = 27
 2 *  4 =  8 3 *  4 = 12 4 *  4 = 16 5 *  4 = 20 6 *  4 = 24 7 *  4 = 28 8 *  4 = 32 9 *  4 = 36
 2 *  5 = 10 3 *  5 = 15 4 *  5 = 20 5 *  5 = 25 6 *  5 = 30 7 *  5 = 35 8 *  5 = 40 9 *  5 = 45
 2 *  6 = 12 3 *  6 = 18 4 *  6 = 24 5 *  6 = 30 6 *  6 = 36 7 *  6 = 42 8 *  6 = 48 9 *  6 = 54
 2 *  7 = 14 3 *  7 = 21 4 *  7 = 28 5 *  7 = 35 6 *  7 = 42 7 *  7 = 49 8 *  7 = 56 9 *  7 = 63
 2 *  8 = 16 3 *  8 = 24 4 *  8 = 32 5 *  8 = 40 6 *  8 = 48 7 *  8 = 56 8 *  8 = 64 9 *  8 = 72
 2 *  9 = 18 3 *  9 = 27 4 *  9 = 36 5 *  9 = 45 6 *  9 = 54 7 *  9 = 63 8 *  9 = 72 9 *  9 = 81

====================== RESTART: C:/Cookpython/code06-08.py =====================
#    2단    ##    3단    ##    4단    ##    5단    ##    6단    ##    7단    ##    8단    ##    9단    #
 2 *  1 =  2 3 *  1 =  3 4 *  1 =  4 5 *  1 =  5 6 *  1 =  6 7 *  1 =  7 8 *  1 =  8 9 *  1 =  9
 2 *  2 =  4 3 *  2 =  6 4 *  2 =  8 5 *  2 = 10 6 *  2 = 12 7 *  2 = 14 8 *  2 = 16 9 *  2 = 18
 2 *  3 =  6 3 *  3 =  9 4 *  3 = 12 5 *  3 = 15 6 *  3 = 18 7 *  3 = 21 8 *  3 = 24 9 *  3 = 27
 2 *  4 =  8 3 *  4 = 12 4 *  4 = 16 5 *  4 = 20 6 *  4 = 24 7 *  4 = 28 8 *  4 = 32 9 *  4 = 36
 2 *  5 = 10 3 *  5 = 15 4 *  5 = 20 5 *  5 = 25 6 *  5 = 30 7 *  5 = 35 8 *  5 = 40 9 *  5 = 45
 2 *  6 = 12 3 *  6 = 18 4 *  6 = 24 5 *  6 = 30 6 *  6 = 36 7 *  6 = 42 8 *  6 = 48 9 *  6 = 54
 2 *  7 = 14 3 *  7 = 21 4 *  7 = 28 5 *  7 = 35 6 *  7 = 42 7 *  7 = 49 8 *  7 = 56 9 *  7 = 63
 2 *  8 = 16 3 *  8 = 24 4 *  8 = 32 5 *  8 = 40 6 *  8 = 48 7 *  8 = 56 8 *  8 = 64 9 *  8 = 72
 2 *  9 = 18 3 *  9 = 27 4 *  9 = 36 5 *  9 = 45 6 *  9 = 54 7 *  9 = 63 8 *  9 = 72 9 *  9 = 81

====================== RESTART: C:/Cookpython/code06-08.py =====================
#   2단   ##   3단   ##   4단   ##   5단   ##   6단   ##   7단   ##   8단   ##   9단   #
 2*  1 =  2 3*  1 =  3 4*  1 =  4 5*  1 =  5 6*  1 =  6 7*  1 =  7 8*  1 =  8 9*  1 =  9
 2*  2 =  4 3*  2 =  6 4*  2 =  8 5*  2 = 10 6*  2 = 12 7*  2 = 14 8*  2 = 16 9*  2 = 18
 2*  3 =  6 3*  3 =  9 4*  3 = 12 5*  3 = 15 6*  3 = 18 7*  3 = 21 8*  3 = 24 9*  3 = 27
 2*  4 =  8 3*  4 = 12 4*  4 = 16 5*  4 = 20 6*  4 = 24 7*  4 = 28 8*  4 = 32 9*  4 = 36
 2*  5 = 10 3*  5 = 15 4*  5 = 20 5*  5 = 25 6*  5 = 30 7*  5 = 35 8*  5 = 40 9*  5 = 45
 2*  6 = 12 3*  6 = 18 4*  6 = 24 5*  6 = 30 6*  6 = 36 7*  6 = 42 8*  6 = 48 9*  6 = 54
 2*  7 = 14 3*  7 = 21 4*  7 = 28 5*  7 = 35 6*  7 = 42 7*  7 = 49 8*  7 = 56 9*  7 = 63
 2*  8 = 16 3*  8 = 24 4*  8 = 32 5*  8 = 40 6*  8 = 48 7*  8 = 56 8*  8 = 64 9*  8 = 72
 2*  9 = 18 3*  9 = 27 4*  9 = 36 5*  9 = 45 6*  9 = 54 7*  9 = 63 8*  9 = 72 9*  9 = 81

======================== RESTART: C:/Cookpython/s6-4.py ========================
#   9단   ##   8단   ##   7단   ##   6단   ##   5단   ##   4단   ##   3단   ##   2단   #
 9*  9 = 81 8*  9 = 72 7*  9 = 63 6*  9 = 54 5*  9 = 45 4*  9 = 36 3*  9 = 27 2*  9 = 18
 9*  8 = 72 8*  8 = 64 7*  8 = 56 6*  8 = 48 5*  8 = 40 4*  8 = 32 3*  8 = 24 2*  8 = 16
 9*  7 = 63 8*  7 = 56 7*  7 = 49 6*  7 = 42 5*  7 = 35 4*  7 = 28 3*  7 = 21 2*  7 = 14
 9*  6 = 54 8*  6 = 48 7*  6 = 42 6*  6 = 36 5*  6 = 30 4*  6 = 24 3*  6 = 18 2*  6 = 12
 9*  5 = 45 8*  5 = 40 7*  5 = 35 6*  5 = 30 5*  5 = 25 4*  5 = 20 3*  5 = 15 2*  5 = 10
 9*  4 = 36 8*  4 = 32 7*  4 = 28 6*  4 = 24 5*  4 = 20 4*  4 = 16 3*  4 = 12 2*  4 =  8
 9*  3 = 27 8*  3 = 24 7*  3 = 21 6*  3 = 18 5*  3 = 15 4*  3 = 12 3*  3 =  9 2*  3 =  6
 9*  2 = 18 8*  2 = 16 7*  2 = 14 6*  2 = 12 5*  2 = 10 4*  2 =  8 3*  2 =  6 2*  2 =  4

======================== RESTART: C:/Cookpython/s6-4.py ========================
#   9단   ##   8단   ##   7단   ##   6단   ##   5단   ##   4단   ##   3단   ##   2단   #
 9*  9 = 81 8*  9 = 72 7*  9 = 63 6*  9 = 54 5*  9 = 45 4*  9 = 36 3*  9 = 27 2*  9 = 18
 9*  8 = 72 8*  8 = 64 7*  8 = 56 6*  8 = 48 5*  8 = 40 4*  8 = 32 3*  8 = 24 2*  8 = 16
 9*  7 = 63 8*  7 = 56 7*  7 = 49 6*  7 = 42 5*  7 = 35 4*  7 = 28 3*  7 = 21 2*  7 = 14
 9*  6 = 54 8*  6 = 48 7*  6 = 42 6*  6 = 36 5*  6 = 30 4*  6 = 24 3*  6 = 18 2*  6 = 12
 9*  5 = 45 8*  5 = 40 7*  5 = 35 6*  5 = 30 5*  5 = 25 4*  5 = 20 3*  5 = 15 2*  5 = 10
 9*  4 = 36 8*  4 = 32 7*  4 = 28 6*  4 = 24 5*  4 = 20 4*  4 = 16 3*  4 = 12 2*  4 =  8
 9*  3 = 27 8*  3 = 24 7*  3 = 21 6*  3 = 18 5*  3 = 15 4*  3 = 12 3*  3 =  9 2*  3 =  6
 9*  2 = 18 8*  2 = 16 7*  2 = 14 6*  2 = 12 5*  2 = 10 4*  2 =  8 3*  2 =  6 2*  2 =  4
 9*  1 =  9 8*  1 =  8 7*  1 =  7 6*  1 =  6 5*  1 =  5 4*  1 =  4 3*  1 =  3 2*  1 =  2


====================== RESTART: C:/Cookpython/code06-05.py =====================
시작값 입력 : 5
끝값 입력 : 94
증가값 입력 : 3
Traceback (most recent call last):
  File "C:/Cookpython/code06-05.py", line 8, in <module>
    for i in range(num1, num2+1, num) :
NameError: name 'num' is not defined. Did you mean: 'num1'?

====================== RESTART: C:/Cookpython/code06-05.py =====================
시작값 입력 : 5
끝값 입력 : 94
증가값 입력 : 3
Traceback (most recent call last):
  File "C:/Cookpython/code06-05.py", line 8, in <module>
    for i in range(num1, num2+1, num3) :
ValueError: range() arg 3 must not be zero

====================== RESTART: C:/Cookpython/code06-05.py =====================
시작값 입력 : 5
끝값 입력 : 94
증가값 입력 : 3
Traceback (most recent call last):
  File "C:/Cookpython/code06-05.py", line 11, in <module>
    print("%d에서 %d까지 %d씩 증가시킨 값의 합계 : %d" &(num1, num2, num3, hap))
TypeError: unsupported operand type(s) for &: 'str' and 'tuple'

====================== RESTART: C:/Cookpython/code06-05.py =====================
시작값 입력 : 5
끝값 입력 : 94
증가값 입력 : 3
5에서 94까지 3씩 증가시킨 값의 합계 : 1455

====================== RESTART: C:/Cookpython/code06-05.py =====================
시작값 입력 : 2
끝값 입력 : 300
증가값 입력 : 3
2에서 300까지 3씩 증가시킨 값의 합계 : 15050

====================== RESTART: C:/Cookpython/code06-04.py =====================
값을 입력하세요 : 100
1에서 100까지의 합계 : 5050

====================== RESTART: C:/Cookpython/code06-03.py =====================
500과 1000 사이에 있는 홀수의 합계 : 187500
print("")

print("\n")


print()

print(" ")
 
for i in range(1, 101, 3) :
    print(i, end=" ")

1 4 7 10 13 16 19 22 25 28 31 34 37 40 43 46 49 52 55 58 61 64 67 70 73 76 79 82 85 88 91 94 97 100 

a=0
while a<3 :
    print("hello")
    a+=1

hello
hello
hello

======================== RESTART: C:/Cookpython/s6-5.py ========================
시작값 입력 : 2
끝값 입력 : 300
증가값 입력 : 3
302에서 300까지 3씩 증가시킨 값의 합계 : 0

======================== RESTART: C:/Cookpython/s6-5.py ========================
시작값 입력 : 2
끝값 입력 : 300
증가값 입력 : 3
302에서 300까지 3씩 증가시킨 값의 합계 : 300

======================== RESTART: C:/Cookpython/s6-5.py ========================
Traceback (most recent call last):
  File "C:/Cookpython/s6-5.py", line 1, in <module>
    i, hap, a = 0, 0
ValueError: not enough values to unpack (expected 3, got 2)

======================== RESTART: C:/Cookpython/s6-5.py ========================
시작값 입력 : 2
끝값 입력 : 300
증가값 입력 : 3
2에서 300까지 3씩 증가시킨 값의 합계 : 302

======================== RESTART: C:/Cookpython/s6-5.py ========================
시작값 입력 : 2
끝값 입력 : 300
증가값 입력 : 3
5 5
8 8
11 11
14 14
17 17
20 20
23 23
26 26
29 29
32 32
35 35
38 38
41 41
44 44
47 47
50 50
53 53
56 56
59 59
62 62
65 65
68 68
71 71
74 74
77 77
80 80
83 83
86 86
89 89
92 92
95 95
98 98
101 101
104 104
107 107
110 110
113 113
116 116
119 119
122 122
125 125
128 128
131 131
134 134
137 137
140 140
143 143
146 146
149 149
152 152
155 155
158 158
161 161
164 164
167 167
170 170
173 173
176 176
179 179
182 182
185 185
188 188
191 191
194 194
197 197
200 200
203 203
206 206
209 209
212 212
215 215
218 218
221 221
224 224
227 227
230 230
233 233
236 236
239 239
242 242
245 245
248 248
251 251
254 254
257 257
260 260
263 263
266 266
269 269
272 272
275 275
278 278
281 281
284 284
287 287
290 290
293 293
296 296
299 299
302 302
2에서 300까지 3씩 증가시킨 값의 합계 : 302

======================== RESTART: C:/Cookpython/s6-5.py ========================
시작값 입력 : 2
끝값 입력 : 300
증가값 입력 : 3
2에서 300까지 3씩 증가시킨 값의 합계 : 15352

======================== RESTART: C:/Cookpython/s6-5.py ========================
시작값 입력 : 2
끝값 입력 : 300
증가값 입력 : 3
Traceback (most recent call last):
  File "C:/Cookpython/s6-5.py", line 12, in <module>
    num += num3
NameError: name 'num' is not defined. Did you mean: 'num1'?

======================== RESTART: C:/Cookpython/s6-5.py ========================
시작값 입력 : 2
끝값 입력 : 300
증가값 입력 : 3
2에서 300까지 3씩 증가시킨 값의 합계 : 15050

====================== RESTART: C:/Cookpython/code06-12.py =====================
더할 첫 번째 수 입력(0 누르면 종료) : 3
더할 두 번째 수 입력 : 15
3 + 15 = 18
더할 첫 번째 수 입력(0 누르면 종료) : 6
더할 두 번째 수 입력 : 8
6 + 8 = 14
더할 첫 번째 수 입력(0 누르면 종료) : 0
0을 입력해 반복문을 탈출했습니다.

======================== RESTART: C:/Cookpython/s6-6.py ========================
더할 첫 번째 수 입력($ 누르면 종료) : 3
더할 두 번째 수 입력 : 65
3 + 65 = 68
더할 첫 번째 수 입력($ 누르면 종료) : 
Traceback (most recent call last):
8  File "C:/Cookpython/s6-6.py", line 4, in <module>
    a=int(input("더할 첫 번째 수 입력($ 누르면 종료) : "))
ValueError: invalid literal for int() with base 10: ''

======================== RESTART: C:/Cookpython/s6-6.py ========================
더할 첫 번째 수 입력($ 누르면 종료) : 3
더할 두 번째 수 입력 : 6
3 + 6 = 9
더할 첫 번째 수 입력($ 누르면 종료) : $
Traceback (most recent call last):
  File "C:/Cookpython/s6-6.py", line 4, in <module>
    a=int(input("더할 첫 번째 수 입력($ 누르면 종료) : "))
ValueError: invalid literal for int() with base 10: '$'

======================== RESTART: C:/Cookpython/s6-6.py ========================
더할 첫 번째 수 입력($ 누르면 종료) : $
Traceback (most recent call last):
  File "C:/Cookpython/s6-6.py", line 4, in <module>
    a=int(input("더할 첫 번째 수 입력($ 누르면 종료) : "))
ValueError: invalid literal for int() with base 10: '$'

======================== RESTART: C:/Cookpython/s6-6.py ========================
더할 첫 번째 수 입력($ 누르면 종료) : $
Traceback (most recent call last):
  File "C:/Cookpython/s6-6.py", line 4, in <module>
    a=int(input("더할 첫 번째 수 입력($ 누르면 종료) : "))
ValueError: invalid literal for int() with base 10: '$'

======================== RESTART: C:/Cookpython/s6-6.py ========================
더할 첫 번째 수 입력($ 누르면 종료) : 56
더할 두 번째 수 입력 : 48
56 + 48 = 104
더할 첫 번째 수 입력($ 누르면 종료) : $
$을 입력해 반복문을 탈출했습니다.

====================== RESTART: C:/Cookpython/code06-14.py =====================
1~100의 합계(3의 배수 제외) : 3367

print('\u2605')
★
print('\u2606')
☆
print('\u2607')
☇
print('\u2601')
☁

====================== RESTART: C:/Cookpython/code06-15.py =====================
    ★
   ★★★
  ★★★★★
 ★★★★★★★
★★★★★★★★★
 ★★★★★★★
  ★★★★★
   ★★★
    ★

====================== RESTART: C:/Cookpython/code06-15.py =====================
        ★
      ★★★
    ★★★★★
  ★★★★★★★
★★★★★★★★★
  ★★★★★★★
    ★★★★★
      ★★★
        ★

======================== RESTART: C:/Cookpython/s6-8.py ========================
        ♥
      ♥♥♥
    ♥♥♥♥♥
  ♥♥♥♥♥♥♥
♥♥♥♥♥♥♥♥♥
  ♥♥♥♥♥♥♥
    ♥♥♥♥♥
      ♥♥♥
        ♥

====================== RESTART: C:/Cookpython/code06-13.py =====================
1~100의 합계를 최초로 1000이 넘게하는 숫자 : 45

======================== RESTART: C:/Cookpython/s6-7.py ========================
1~100의 합계를 최초로 1000이 넘게하는 숫자 : 46

======================== RESTART: C:/Cookpython/s6-7.py ========================
1~100의 합계를 최초로 1000이 넘게하는 숫자 : 45

====================== RESTART: C:/Cookpython/code06-11.py =====================
계산할 첫 번째 수 입력 : 6
계산할 두 번째 수 입력 : 8
계산할 연산자 입력 : +
연산자를 잘못 입력했습니다.
계산할 첫 번째 수 입력 : 6
계산할 두 번째 수 입력 : 49
계산할 연산자 입력 : /
6 / 49 = 0
계산할 첫 번째 수 입력 : 
====================== RESTART: C:/Cookpython/code06-11.py =====================
계산할 첫 번째 수 입력 : 6
계산할 두 번째 수 입력 : 49
계산할 연산자 입력 : /
6 / 49 = 0.122449
계산할 첫 번째 수 입력 : 495
계산할 두 번째 수 입력 : 11
계산할 연산자 입력 : %
Traceback (most recent call last):
  File "C:/Cookpython/code06-11.py", line 18, in <module>
    print("%d % %d = %d" % (a, b, a%b))
ValueError: unsupported format character '%' (0x25) at index 5


====================== RESTART: C:/Cookpython/code06-11.py =====================
계산할 첫 번째 수 입력 : 645
계산할 두 번째 수 입력 : 648
계산할 연산자 입력 : --
연산자를 잘못 입력했습니다.
계산할 첫 번째 수 입력 : 
Traceback (most recent call last):
  File "C:/Cookpython/code06-11.py", line 5, in <module>
    a = int(input("계산할 첫 번째 수 입력 : "))
ValueError: invalid literal for int() with base 10: ''

====================== RESTART: C:/Cookpython/code06-09.py =====================
1에서 10까지의 합계 : 55

====================== RESTART: C:/Cookpython/code06-10.py =====================
더할 첫 번째 수 입력: 
    6 / 49 = 0.122449
Traceback (most recent call last):
  File "C:/Cookpython/code06-10.py", line 4, in <module>
    a=int(input("더할 첫 번째 수 입력: "))
ValueError: invalid literal for int() with base 10: ''

====================== RESTART: C:/Cookpython/code06-10.py =====================
더할 첫 번째 수 입력: 55
더할 두 번째 수 입력: 22
55 + 22 = 77
더할 첫 번째 수 입력: 77
더할 두 번째 수 입력: 128
77 + 128 = 205
더할 첫 번째 수 입력: 
Traceback (most recent call last):
  File "C:/Cookpython/code06-10.py", line 4, in <module>
    a=int(input("더할 첫 번째 수 입력: "))
ValueError: invalid literal for int() with base 10: ''
wc=2002

for i in range(2002, 2051, 4) :
    print(i)

2002
2006
2010
2014
2018
2022
2026
2030
2034
2038
2042
2046
2050
price_list = [32100, 32150, 32000, 32500]
for i in range(4) :
    print(price_list[i])

32100
32150
32000
32500
i, k = 0, 0
